app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_user
    return unless session[:user_id]
    @current_user ||= User.find(session[:user_id])

INSERT INTO "calendars" ("id", "name", "date", "time", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def addEvent(event)
    @event = event
    @calendar = Calendar.new(@event.attributes)
    @calendar.user_id = session[:user_id]
    @calendar.save