app/controllers/calendars_controller.rb

  def edit
    @calendar = Calendar.find(params[:id])
---
SELECT "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]