app/controllers/events_controller.rb

  def index
    @event = Event.all
---
SELECT "events".* FROM "events"

  def create
    @event = Event.new(event_params)
    @event.save
---
INSERT INTO "events" ("name", "date", "time", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "picnic"], ["date", "4/10"], ["time", "5"], ["description", "something"], ["created_at", "2021-07-04 04:16:54.209056"], ["updated_at", "2021-07-04 04:16:54.209056"]]