app/controllers/groups_controller.rb

  def index
    @group = Group.all
---
SELECT "groups".* FROM "groups"

  def create
    @group = Group.new(group_params)
    @group.save
---
INSERT INTO "groups" ("name", "mentor", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test"], ["mentor", ""], ["description", ""], ["created_at", "2021-10-29 17:49:56.482567"], ["updated_at", "2021-10-29 17:49:56.482567"]]