app/controllers/mlmc_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? ORDER BY created_at DESC  [["user_id", 2]]
---
    def index
        @task = Task.new
        @tasks = Task.where(:user_id => session[:user_id]).order("created_at DESC")