app/controllers/resources_controller.rb

SELECT "resources".* FROM "resources" ORDER BY created_at DESC
---
    def index
        @resources = Resource.all.order("created_at DESC")