app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? ORDER BY created_at DESC  [["user_id", 2]]
---
    def index
        @tasks = Task.where(:user_id => session[:user_id]).order("created_at DESC")

INSERT INTO "tasks" ("title", "date", "time", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "test3"], ["date", ""], ["time", ""], ["description", ""], ["created_at", "2021-11-02 01:52:45.153089"], ["updated_at", "2021-11-02 01:52:45.153089"], ["user_id", 2]]
---
    def create
        @task = Task.new(task_params)
        @task.user_id = session[:user_id]
        @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? ORDER BY created_at DESC  [["user_id", 2]]
---
    def show
        @tasks = Task.where(:user_id => session[:user_id]).order("created_at DESC")